TensorDT/uCOS-II_MC9S12DG256/Source/MC9S12DG256/mc9s12dg256_bootloader.c
//*********************************************************************
//
//  File name:  mc9s12dg256_bootloader.c
//
//  Purpose:    Bootloader module
//
//  Target:     MC9S12DG256-based board
//
//  Revisions:
//   ##  dd mmm yyyy  who  description
//    1  03 Nov 2020  GPM  Initial revision (based on CTF Recorder
//                         board bootloader.c file).
//
//  (c) 2020 Tensor Drilling Technologies, Inc. All rights reserved.
//  (p) 2020 Tensor Drilling Technologies, Inc. All rights reserved.
//
//  Notes:
//  As this is bootloader code that will be copied to and run from
//  RAM, we want to minimize the stack size required. Thus, local
//  variables and passed parameters are minimized (although this
//  leads to less-than-ideal code).
//
//  Tensor Drilling Technologies
//  2418 North Frazier St., Suite 100
//  Conroe, TX 77303
//********************************************************************/

//--------------------------- Included Files --------------------------
#include "mc9s12dg256_boot.h"
#include "iosdg256.h"
#include "datatypes.h"

//-------------------------- Type Definitions -------------------------
// none

//------------------------ Constant Definitions -----------------------
// Boolean true and false definitions
#define BTRUE                          (1==1)
#define BFALSE                         (0==1)

// Bootloader RAM start and end addresses
#define BL_RAM_ADDR_START              (0x3A00)
#define BL_RAM_ADDR_END                (0x3EFF)

// Erase memory (EEPROM or flash) error codes
#define ERASE_MEM_NO_ERROR             (0)    // erase successful
#define ERASE_MEM_PVIOL_ACCERR_ERR     (1)    // erase protection violation or access error
#define ERASE_MEM_BUFF_NOT_EMPTY       (2)    // erase buffer not empty error

// Write memory (EEPROM or flash) error codes
#define WRITE_MEM_NO_ERROR             (0)    // write successful
#define WRITE_MEM_PVIOL_ACCERR_ERR     (1)    // write protection violation or access error
#define WRITE_MEM_RESERVED_ERR         (2)    // reserved (previously CLKDIV not written yet)
#define WRITE_MEM_RANGE_ERR            (3)    // address or page out of range
#define WRITE_MEM_VERIFY_ERR           (4)    // written value verification error

#define CHECKSUM_ERR                   (0xFF)

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//
//  Bootloader command format:
//
//   Framing |  Msg   | Command | ....Data....  | Checksum |
//    Byte   |  Len   |  Byte   | ...Byte(s)... |   Byte   |
//    STX    |  Byte  |  0x55   |               |  (see    |
//    or     | (see   |  0x66   |               |   note)  |
//    ETB    |  note) |  0x99   |               |          |
//           |        |   or    |               |          |
//           |        |  0xAA   |               |          |
//
//  NOTES:
//    * The message length is the number of bytes from (and including)
//      the command byte to (and including) the checksum byte. Thus,
//      it is equal to (2 + number of data bytes).
//    * The number of data bytes can vary from 0 to 253.
//    * The checksum is the one's complement of the sum of the
//      message bytes excluding the framing and checksum bytes.
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#define IDX_FRAMING_BYTE               (0)  // index of "framing" byte (STX or ETB)
#define IDX_MSG_LEN_BYTE               (1)  // index of message length (in bytes) byte
#define IDX_CMD_BYTE                   (2)  // index of command byte
#define IDX_ADDR_START_BYTE_2          (3)  // most-significant start addr byte
#define IDX_ADDR_START_BYTE_1          (4)
#define IDX_ADDR_START_BYTE_0          (5)  // least-significant start addr byte
                                            // (only sent for flash addresses!)

// The fewest number of bytes in a valid command
// (The +1 is for the checksum byte)
#define CMD_NUM_BYTES_MIN              (IDX_CMD_BYTE+1)

// Bootloader commands
#define BT_CMD_FLASH_ERASE             (0x55)
#define BT_CMD_FLASH_PGM_VER           (0x66)
#define BT_CMD_EEPROM_PGM_VER          (0x99)
#define BT_CMD_EEPROM_ERASE            (0xAA)

#define NUM_MSG_HDR_BYTES_FLASH        (IDX_ADDR_START_BYTE_0 + 1)
#define NUM_MSG_HDR_BYTES_EEPROM       (IDX_ADDR_START_BYTE_1 + 1)

#define BYTES_PER_WORD                 (2)

//------------------------------- Macros ------------------------------
// none

//-------------------------- Module Variables -------------------------
// none

//-------------------------- Global Variables -------------------------
// These are "temporary" global variables used only during bootloading
// process.
// NOTE: These variable are located in RAM at addresses below where the
//       bootloader code will reside. There are also variables declared
//       in booting.c; make sure these variables do not overlap with
//       the ones in booting.c.
//
UINT8         TempUINT8      @0x39F0;
UINT8         Index          @0x39F1;
BOOL          WasBTCmdRcvd   @0x39F2;
UINT8         ErrorNum       @0x39F3;
UINT8         Checksum       @0x39F4;
UINT8         PageFlash      @0x39F5;
UINT8         CntrBytes      @0x39F6;

UINT16        TempUINT16     @0x39F8;
UINT16        Addr1          @0x39FA;
UINT16        Addr2          @0x39FC;

//------------------------------ Functions ----------------------------
// Protypes
// Ordinarily the functions would be ordered so that prototypes are
// unnecessary. However, in this case, the bootloader function
// *MUST* be the first one listed so that it starts at the beginning
// of the bootloader RAM code space. Hence, the need to prototype
// the local functions called by the bootloader function.
_NEAR static void delayMilliseconds(UINT16 delay_ms);
_NEAR static void processCommand(void);

//*********************************************************************
// BootLoaderToRunFromRAM
// This is the bootloader function to be copied to and executed from
// RAM.
//*********************************************************************
_NEAR void BootLoaderToRunFromRAM(void)
{
#define NO_ERROR               (0)

    // Initialize internal EEPROM registers
    ECLKDIV = 0x1A;          // ECLK = OSC/(26+1) = 4915200/27 = 182044 Hz
                             //   (must be between 150KHz and 200KHz)
    ECNFG   = 0x00;          // Disable both CBEIE and CCIE
    EPROT   = 0xFF;          // This value is loaded from an EEPROM byte at 0x4FFD at startup
    ESTAT  |= (ESTAT_PVIOL | // Clear PVIOL and ACCERR flags
               ESTAT_ACCERR); 

    // Initialize internal flash registers
    FCLKDIV = 0x1A;          // ECLK = OSC/(26+1) = 4915200/27 = 182044 Hz
                             //   (must be between 150KHz and 200KHz)
    FCNFG   = 0x00;          // Disable related interrupts and security key writing
    FPROT   = 0xFF;          // No flash protection
    FSTAT  |= (FSTAT_PVIOL | // Clear PVIOL and ACCERR flags
               FSTAT_ACCERR);

    PPAGE   = 0;             // Reset to page 0 (default)

    // Reset these variables for receiving multiple commands
    BuffRx[0] = 0;
    Index = 0;
    WasBTCmdRcvd = BFALSE;
    CntrBytes = 0;

    while (BuffRx[IDX_FRAMING_BYTE] != ETB) {

        if (SCI0SR1 & 0x20) {     // received a byte?

