TensorDT/uCOS-II_MC9S12DG256/Source/MC9S12DG256/mc9s12dg256_bootloader.c
            BuffRx[Index] = SCI0DRL;

            if (Index == IDX_FRAMING_BYTE) {

                // The first character must be STX (if we will be receiving
                // a command) or ETB (if we're done bootloading). If it
                // isn't, perhaps it's noise so we'll keep looking for
                // STX or ETB in the next 255 characters before giving up
                // and jumping to the application code.
                if ((BuffRx[IDX_FRAMING_BYTE] != STX) &&
                    (BuffRx[IDX_FRAMING_BYTE] != ETB)) {

                    if (CntrBytes < UINT8_MAX) {
                        // Increment the byte counter and keep looking
                        // for the next STX or ETB.
                        CntrBytes++;
                    }
                    else {
                        // Give up and jump to execute the application
                        // (hopefully it hasn't been erased).
                        #pragma asm
                            jmp $4000
                        #pragma endasm
                    }  // end of else (CntrBytes == UINT8_MAX)
                }  // end of framing byte not STX nor ETB
                else {
                    // Found an STX or ETB. Reset the counter for looking
                    // for STX or ETB.
                    CntrBytes = 0;
                }
            }
            else if (Index >= CMD_NUM_BYTES_MIN) {
                // Check if all the command bytes have been received
                // (based on the message length byte).
                if ((Index-1) == BuffRx[IDX_MSG_LEN_BYTE]) {
                    // Yes, the command receipt is done.
                    WasBTCmdRcvd = BTRUE;
                }
            }
            Index++;
        }

        if (WasBTCmdRcvd) {

            // A command was received. Calculate the message checksum and
            // compare it to transmitted checksum (sent in the last
            // command message byte). 
            // Calculate the checksum as the one's complement of the
            // sum of the message bytes (excluding the framing and
            // the checksum bytes). 
            Checksum = 0;
            Index = BuffRx[IDX_MSG_LEN_BYTE]+1; // Get the checksum byte index.
            for (TempUINT8=IDX_MSG_LEN_BYTE;
                 TempUINT8 < Index;
                 TempUINT8++) {
                Checksum += BuffRx[TempUINT8];
            }
            Checksum = 0xFF - Checksum;     // One's complement

            if (Checksum == BuffRx[Index]) {
                // The checksum values match; process the command.
                // It will put the error indicator in ErrorNum.
                processCommand();
            }
            else {
                // Error - the checksum values don't match.
                ErrorNum = CHECKSUM_ERR;
            }

            TX_MODE();             // Switch to transmit mode

#if defined DEBUG
            delayMilliseconds(1);  // Shorter delay due to debugger slowness.
#else			
            delayMilliseconds(20); // Delay 20ms before sending an ACK or NACK.
#endif

            if (ErrorNum == NO_ERROR) {

                // No error occurred so send an ACK. Wait for the
                // character transmission to complete.
                SCI0DRL = ACK;
                while (!(SCI0SR1 & SCISCR1_SCISWAI)) {;}

                // Return to receive mode. Read the SCI's status and data
                // registers to clear any interrupt flag.
                RX_MODE();
                TempUINT8 = SCI0SR1;
                TempUINT8 = SCI0DRL;
            }

            else {

                // An error occurred so send a NACK. Wait for the
                // character transmission to complete.
                SCI0DRL = NAK;
                while (!(SCI0SR1 & SCISCR1_SCISWAI)) {;}

                // Return to receive mode. Read the SCI's status and data
                // registers to clear any interrupt flag.
                RX_MODE();
                TempUINT8 = SCI0SR1;
                TempUINT8 = SCI0DRL;

                // If it's not a checksum error, skip bootloading -
                // jump to the application code start.
                if (ErrorNum != CHECKSUM_ERR) {
                    #pragma asm
                        jmp $4000
                    #pragma endasm
                }
            }

            // Reset variables for receiving multiple commands.
            BuffRx[0] = 0;
            Index = 0;
            WasBTCmdRcvd = BFALSE;
        }
    }

    // We're done bootloading; jump to the application code start.
    #pragma asm
        jmp $4000
    #pragma endasm

    return;
}

//*********************************************************************
// delayMilliseconds
// This function creates a delay of length (in milliseconds)
// equal to the specified parameter.
//
// NOTE: This function does NOT use a processor timer. Rather,
//       it is simply a "NOP" loop tuned to be approximately a
//       millisecond in duration when the crystal frequency is
//       4.9152 MHz.
//*********************************************************************
_NEAR static void delayMilliseconds(
    UINT16 delay_ms)         // software delay in milliseconds
{
    UINT16 cntr_ms;
    UINT8  cntr1msLp;
    
    for (cntr_ms = 0;
         cntr_ms < delay_ms;
         cntr_ms++) {
        // This loops takes ~1ms to execute
        for (cntr1msLp = 0; cntr1msLp < 221; cntr1msLp++) {
            NOP();
        }
    }

    return;
}


//*********************************************************************
// eraseFlash
// This function erases all the MC9S12DG256 internal flash except
// the boot code area from 0xF800 to 0xFFFF (page 0x3F).
// This function assumes that the FCLKDIV register has already been
// set to divide the oscillator down to within [150,200] kHz.
// This function returns an error indicator as follows:
//   0 - erase successful (no error)
//   1 - PVIOL/ACCERR flag(s) set
//   2 - address, data, and/or command buffer not empty
//*********************************************************************
#ifdef USE_SLOWER_FLASH_ERASE
_NEAR static UINT8 eraseFlash(void)
{
#define CALC_BLOCK_FROM_PG(page)       ((0x3F - (page)) >> 2)

    for (PageFlash = 0x30; PageFlash <= 0x3F; PageFlash++) {

        // Set the Flash Configuration Register to disable related interrupts,
        // disable writing security keys, and select the memory bank (block)
        // to be erased.
        FCNFG = CALC_BLOCK_FROM_PG(PageFlash);

        // Select the page.
        PPAGE = PageFlash;

        // This version is NOT concerned about preserving flash page 0x38.
        // Erase the page one sector (256 words or 512 bytes) at a time.
        // Note than when placing an unbanked page number (i.e., 0x3E or 0x3F)
        // in the PPAGE register, that page can be seen twice in the MCU
        // memory map - once within the unbanked logical address (i.e.,
        // within [0x4000,0x7FFF] for page 0x3E or within [0xC000,0xFFFF] for
        // page 0x3F) and again within the paged logical address range
        // [0x8000,0xBFFF]. (See S12FTS256KV3/D V03.01 p. 15 NOTE 1)
        for (Addr1 = FLASH_PAGE_START_ADDR;
             Addr1 < FLASH_PAGE_END_ADDR;
             Addr1 += NUM_FLASH_BYTES_PER_SECTOR) {

            // Do not erase the boot code area
            // Since the boot code area contains the vectable, this is
            // why we must use a jump table (the vectable can't be changed
            // via the firmware loader).
            if ((PageFlash == 0x3F) && (Addr1 >= BT_PAGE_ST_ADDR_BNKD)) {
                break;
            }

            // Start the sector erase sequence:
            // (1) Write a dummy value to anywhere within the page.
            // (2) Write the sector erase command to the command buffer.
            // (3) Launch the command by writing a '1' to the CBEIF flag.
            *((volatile UINT16 *)Addr1) = 0xFFFF;
            FCMD   = FLASH_SECTOR_ERASE;
            FSTAT |= FSTAT_CBEIF;

            // Delay a little bit.
            NOP();
            NOP();

