TensorDT/uCOS-II_MC9S12DG256/Source/MC9S12DG256/mc9s12dg256_bootloader.c
            // Check for protection violation and access error indications.
            // If any error is indicated, clear the error flag.
            if (FSTAT & (FSTAT_PVIOL | FSTAT_ACCERR)) {
                if (FSTAT & FSTAT_PVIOL)  { FSTAT |= FSTAT_PVIOL;  }
                if (FSTAT & FSTAT_ACCERR) { FSTAT |= FSTAT_ACCERR; }
                return (ERASE_MEM_PVIOL_ACCERR_ERR);
            }

            // Wait for the flash command buffer to be ready for the next
            // command sequence.
            while (!(FSTAT & FSTAT_CBEIF)) {;}

            // Wait for the sector erase command to complete.
            while (!(FSTAT & FSTAT_CCIF))  {;}

        }  // end of for Addr1 loop

    }  // end of PageFlash loop

    return (ERASE_MEM_NO_ERROR);
}

#else

_NEAR static UINT8 eraseFlash(void)
{
#define CALC_BLK_START_PG(blk)         (0x3C - ((blk) << 2))

    // Clear any previous protection and/or access error flag.
    FSTAT |= (FSTAT_PVIOL | FSTAT_ACCERR);
    
    // Wait for the flash command buffer to be ready to accept a new command.
    while (!(FSTAT & FSTAT_CBEIF)) {;}

    //***** Erase blocks 1, 2, and 3 first *****
    for (TempUINT8=1; TempUINT8 <= 3; TempUINT8++) {
        // Set the Flash Configuration Register to disable related interrupts,
        // disable writing security keys, and select the memory bank (block)
        // to be erased.
        FCNFG = TempUINT8;

        // Select a page within the block to be erased. Here we select the
        // first page of the block.
        PPAGE = CALC_BLK_START_PG(TempUINT8);

        // Verify that the buffers are ready to accept a new command.
        if ((FSTAT & FSTAT_CBEIF) == 0) {
            return (ERASE_MEM_BUFF_NOT_EMPTY);
        }

        // Buffers are ready so start the block erase sequence:
        // (1) Write a dummy value to anywhere within the flash.
        // (2) Write the (block/mass) erase command to the command buffer.
        // (3) Launch the command by writing a '1' to the CBEIF flag.
        *((volatile UINT16 *)FLASH_PAGE_START_ADDR) = 0xFFFF;
        FCMD  = FLASH_MASS_ERASE;
        FSTAT|= FSTAT_CBEIF;

        // Delay a little bit.
        NOP();
        NOP();

        // Check for protection violation and access error indications.
        // If any error is indicated, clear the error flag.
        if (FSTAT & (FSTAT_PVIOL | FSTAT_ACCERR)) {
            if (FSTAT & FSTAT_PVIOL)  { FSTAT |= FSTAT_PVIOL;  }
            if (FSTAT & FSTAT_ACCERR) { FSTAT |= FSTAT_ACCERR; }
            return (ERASE_MEM_PVIOL_ACCERR_ERR);
        }

        // Wait for the flash command buffer to be ready for the next
        // command sequence.
        while (!(FSTAT & FSTAT_CBEIF));
    }

    //***** Erase block 0 one sector at a time *****
    // Do not erase the entire block as we do not want to erase the
    // boot code area. Recall that block 0 consists of pages
    // 0x3C-0x3F.
    for (PageFlash = 0x3C; PageFlash <= 0x3F; PageFlash++) {
        // Set the Flash Configuration Register to disable related interrupts,
        // disable writing security keys, and select the memory bank (block)
        // (block 0) containing sectors to be erased.
        FCNFG = 0;

        // Select the page within the block.
        PPAGE = PageFlash;

        // Verify that the buffers are ready to accept a new command.
        if ((FSTAT & FSTAT_CBEIF) == 0) {
            return (ERASE_MEM_BUFF_NOT_EMPTY);
        }

        // Erase the entire page one sector (256 words or 512 bytes) at a time.
        // Note than when placing an unbanked page number (i.e., 0x3E or 0x3F)
        // in the PPAGE register, that page can be seen twice in the MCU
        // memory map - once within the unbanked logical address (i.e.,
        // within [0x4000,0x7FFF] for page 0x3E or within [0xC000,0xFFFF] for
        // page 0x3F) and again within the paged logical address range
        // [0x8000,0xBFFF]. (See S12FTS256KV3/D V03.01 p. 15 NOTE 1)
        for (Addr1 = FLASH_PAGE_START_ADDR;
             Addr1 < FLASH_PAGE_END_ADDR;
             Addr1 += NUM_FLASH_BYTES_PER_SECTOR) {

            // Do not erase the boot code area
            if ((PageFlash == 0x3F) && (Addr1 >= BT_PAGE_ST_ADDR_BNKD)) {
                break;
            }

            // Buffers are ready so start the sector erase sequence:
            // (1) Write a dummy value to anywhere within the page.
            // (2) Write the sector erase command to the command buffer.
            // (3) Launch the command by writing a '1' to the CBEIF flag.
            *((volatile UINT16 *)Addr1) = 0xFFFF;
            FCMD   = FLASH_SECTOR_ERASE;
            FSTAT |= FSTAT_CBEIF;

            // Delay a little bit.
            NOP();
            NOP();

            // Check for protection violation and access error indications.
            // If any error is indicated, clear the error flag.
            if (FSTAT & (FSTAT_PVIOL | FSTAT_ACCERR)) {
                if (FSTAT & FSTAT_PVIOL)  { FSTAT |= FSTAT_PVIOL;  }
                if (FSTAT & FSTAT_ACCERR) { FSTAT |= FSTAT_ACCERR; }
                return (ERASE_MEM_PVIOL_ACCERR_ERR);
            }

            // Wait for the flash command buffer to be ready for the next
            // command sequence.
            while (!(FSTAT & FSTAT_CBEIF)) {;}
        }
    }

    // Wait for the last command to be completed.
    while (!(FSTAT & FSTAT_CCIF));

    return (ERASE_MEM_NO_ERROR);
}

#endif


//*********************************************************************
// eraseEEPROM
// This function mass erases the MC9S12DG256 internal EEPROM.
// This function assumes that the ECLKDIV register has already been
// set to divide the oscillator down to within [150,200] kHz.
// Function reference: S12EETS4KV1 pp. 16-19
// This function returns an error indicator as follows:
//   ERASE_MEM_NO_ERROR:          0   erase successful (no error)
//   ERASE_MEM_PVIOL_ACCERR_ERR:  1   PVIOL/ACCERR flag(s) set
//*********************************************************************
_NEAR static UINT8 eraseEEPROM(void)
{
    // Clear any previous protection and/or access error flag.
    ESTAT |= (ESTAT_PVIOL | ESTAT_ACCERR);

    // Wait for the EEPROM command buffer to be ready to accept a new command.
    while (!(ESTAT & ESTAT_CBEIF)) {;}

    // Buffers are ready so start the mass erase sequence:
    // (1) Write a dummy value to anywhere within the EEPROM.
    // (2) Write the mass erase command to the command buffer.
    // (3) Launch the command by writing a '1' to the CBEIF flag.
    *((volatile UINT16 *)EE_START_ADDR) = 0xFFFF;
    ECMD   = EE_MASS_ERASE;
    ESTAT |= ESTAT_CBEIF;

    // Delay a little bit.
    NOP();
    NOP();

