TensorDT/uCOS-II_MC9S12DG256/Source/MC9S12DG256/mc9s12dg256_bootloader.c
    // Check for protection violation and access error indications.
    // If any error is indicated, clear the error flag.
    if (ESTAT & (ESTAT_PVIOL | ESTAT_ACCERR)) {
        if (ESTAT & ESTAT_PVIOL)  { ESTAT |= ESTAT_PVIOL;  }
        if (ESTAT & ESTAT_ACCERR) { ESTAT |= ESTAT_ACCERR; }
        return (ERASE_MEM_PVIOL_ACCERR_ERR);
    }

    // Wait for the mass erase command to complete.
    while (!(ESTAT & ESTAT_CCIF));

    return (ERASE_MEM_NO_ERROR);
}


//*********************************************************************
// programThenVerifyFlash
// This function programs data received in the FLASH-PROGRAM-THEN-VERIFY
// command one word at time, verifying each word after programming it.
// This function returns an error indicator as follows:
//   WRITE_MEM_NO_ERROR          0  write successful
//   WRITE_MEM_PVIOL_ACCERR_ERR  1  write protection violation or access error
//   WRITE_MEM_RESERVED_ERR      2  reserved (previously CLKDIV not written yet)
//   WRITE_MEM_RANGE_ERR         3  address or page out of range
//   WRITE_MEM_VERIFY_ERR        4  written value verification error
//*********************************************************************
_NEAR static UINT8 programThenVerifyFlash(void)
{
    // Determine the flash page number from the two address upper bytes.
    // Save the page number in TempUINT8.
	TempUINT16 =
        ((UINT16)BuffRx[IDX_ADDR_START_BYTE_2] << 8) +
        BuffRx[IDX_ADDR_START_BYTE_1];
    TempUINT8 = (UINT8)(TempUINT16 >> 6);

    // Check that the page number is valid.
    if ((TempUINT8 < 0x30) || (TempUINT8 > 0x3F)) {
        return(WRITE_MEM_RANGE_ERR);
    }

    // Calculate the logical (banked) start address. Note that the unbanked
    // pages (0x3E and 0x3F) will still show up in the banked memory
    // [0x8000,0xBFFF] if the page number is set in PPAGE. So, as long as
    // we always set PPAGE in this function, we can always work within
    // the banked memory range. (See S12FTS256KV3/D V03.01 p. 15 NOTE 1)
    // Use the lower 6 bits of BuffRx[IDX_ADDR_START_BYTE_1] and
    // all of BuffRx[IDX_ADDR_START_BYTE_0] to calculate the offset into the
    // bank window [0x8000, 0xBFFF].
	BuffRx[IDX_ADDR_START_BYTE_1] &= 0x3F;
	Addr1 = *((UINT16 *)&BuffRx[IDX_ADDR_START_BYTE_1]) + 0x8000; 

    // Calculate the logical end address (the address for writing
    // the last data byte).
    // Recall that the message length value is the number of bytes
    // excluding the framing byte so there is a "natural" minus 1
    // in the calculation.
    Addr2 = Addr1 + BuffRx[IDX_MSG_LEN_BYTE] - NUM_MSG_HDR_BYTES_FLASH;

    // Check the validity of the start and end addresses.
	if ((Addr1 < FLASH_PAGE_START_ADDR) ||
		(Addr2 > FLASH_PAGE_END_ADDR)) {
        return(WRITE_MEM_RANGE_ERR);
    }

    // Attempting to program in boot code area is ignored, but return
    // success value so an ACK will be sent back.
    if ((TempUINT8 == 0x3F) && (Addr2 >= BT_PAGE_ST_ADDR_BNKD)) {
        return (WRITE_MEM_NO_ERROR);
    }

    // Set the Flash Configuration Register to disable related interrupts,
    // disable writing security keys, and select the memory bank (block)
    // to be programmed.
    if      (TempUINT8 < 0x34) { FCNFG = 3; } // flash block 3
    else if (TempUINT8 < 0x38) { FCNFG = 2; } // flash block 2
    else if (TempUINT8 < 0x3C) { FCNFG = 1; } // flash block 1
    else                       { FCNFG = 0; } // flash block 0

    // Set the page to be programmed. This must be done even for the
    // unbanked pages so we can use banked memory logical addresses
    // for all pages.
    PPAGE = TempUINT8;

    // Now that PPAGE is set, we will use TempUINT8 to store the index
    // (within the received message buffer) of the data to program.

    // If the starting address is not on a word boundary (i.e., it is
    // an odd address), force it to be on a word boundary by decrementing
    // it (by 1) and pre-pend the value of the byte at the new start address
    // to the array of bytes to be programmed. (This will mean overwriting
    // the last header byte but we've already used the header bytes so
    // overwriting it is okay at this point.)
    if (Addr1 & 0x0001) {
        TempUINT8 = NUM_MSG_HDR_BYTES_FLASH - 1;
        Addr1--;
        BuffRx[TempUINT8] = *((volatile UINT8 *)Addr1);
    }
    else { // an even starting address
        TempUINT8 = NUM_MSG_HDR_BYTES_FLASH;
    }

    // If the ending address is not the end of a word (i.e., not an odd
    // address), force it to be odd by incrementing it (by 1) and appending
    // the value of the byte at the new end address to the array of bytes to
    // be programmed. (This will mean overwriting the checksum byte but we've
    // already used it so it's okay to overwrite it at this point.)
    if (!(Addr2 & 0x0001)) {
        Addr2++;
        BuffRx[BuffRx[IDX_MSG_LEN_BYTE]+1] = *((volatile UINT8*)Addr2);
    }

    // Wait for any flash command in progress to complete.
    while (!(FSTAT & FSTAT_CCIF));

    // Program the data one word at a time. After writing, verify that the
    // word was programmed correctly.
    while (Addr1 < Addr2) {

		// high + low bytes of a data word
		TempUINT16 = ((UINT16)BuffRx[TempUINT8] << 8) + BuffRx[TempUINT8+1];

        // Start the word programming sequence:
        // (1) Write the word to the desired address.
        // (2) Write the program word command to the command buffer.
        // (3) Launch the command by writing a '1' to the CBEIF flag.
        *((volatile UINT16 *)Addr1) = TempUINT16;
        FCMD   = FLASH_PROGRAM_WORD; // start command
        FSTAT |= FSTAT_CBEIF;        // Launch command by setting CBEIF

        // Delay a little bit.
        NOP();
        NOP();

        // Check for protection violation and access error indications.
        // If any error is indicated, clear the error flag.
        if (FSTAT & (FSTAT_PVIOL | FSTAT_ACCERR)) {
            if (FSTAT & FSTAT_PVIOL)  { FSTAT |= FSTAT_PVIOL;  }
            if (FSTAT & FSTAT_ACCERR) { FSTAT |= FSTAT_ACCERR; }
            return (ERASE_MEM_PVIOL_ACCERR_ERR);
        }

        // Wait for the word programming to complete.
        while (!(FSTAT & FSTAT_CCIF));

