TensorDT/uCOS-II_MC9S12DG256/Source/MC9S12DG256/mc9s12dg256_bootloader.c
        // Verify that the word was correctly programmed.
        if (*((volatile UINT16*)Addr1) != TempUINT16) {
            return (WRITE_MEM_VERIFY_ERR);
        }

        // Increment data byte index and address to program for next time.
        TempUINT8 += BYTES_PER_WORD;
        Addr1     += BYTES_PER_WORD;

	}  // end of while (Addr1 < Addr2)

    return (WRITE_MEM_NO_ERROR);
}


//*********************************************************************
// programThenVerifyEEPROM
// This function programs data received in the EEPROM-PROGRAM-THEN-VERIFY
// command one word at time, verifying each word after programming it.
// This function returns an error indicator as follows:
//   WRITE_MEM_NO_ERROR          0  write successful
//   WRITE_MEM_PVIOL_ACCERR_ERR  1  write protection violation or access error
//   WRITE_MEM_RESERVED_ERR      2  reserved (previously CLKDIV not written yet)
//   WRITE_MEM_RANGE_ERR         3  address or page out of range
//   WRITE_MEM_VERIFY_ERR        4  written value verification error
//*********************************************************************
_NEAR static UINT8 programThenVerifyEEPROM(void)
{
    // Calculate the memory to program starting address. Note that only
    // bytes 2 and 1 are used (i.e., address start byte 0 is not sent).
    Addr1 = ((UINT16)BuffRx[IDX_ADDR_START_BYTE_2] << 8) +
            BuffRx[IDX_ADDR_START_BYTE_1];

    // Calculate the program ending address.
    Addr2 = Addr1 + BuffRx[IDX_MSG_LEN_BYTE] - NUM_MSG_HDR_BYTES_EEPROM;

    // Check the address validity.
    if ((Addr1 < EE_START_ADDR) ||
        (Addr2 > EE_END_ADDR)) {
        return (WRITE_MEM_RANGE_ERR);
    }

    // We will use TempUINT8 to store the index (within the received
    // message buffer) of the data to program.

    // If the starting address is not on a word boundary (i.e., it is
    // an odd address), force it to be on a word boundary by decrementing
    // it (by 1) and pre-pend the value of the byte at the new start address
    // to the array of bytes to be programmed. (This will mean overwriting
    // the last header byte but we've already used the header bytes so
    // overwriting it is okay at this point.)
    if (Addr1 & 0x0001) {
        TempUINT8 = NUM_MSG_HDR_BYTES_EEPROM - 1;
        Addr1--;
        BuffRx[TempUINT8] = *((volatile UINT8*)Addr1);
    }
    else { // an even starting address
        TempUINT8 = NUM_MSG_HDR_BYTES_EEPROM;
    }

    // If the ending address is not the end of a word (i.e., not an odd
    // address), force it to be odd by incrementing it (by 1) and appending
    // the value of the byte at the new end address to the array of bytes to
    // be programmed. (This will mean overwriting the checksum byte but we've
    // already used it so it's okay to overwrite it at this point.)
    if (!(Addr2 & 0x0001)) {
        Addr2++;
        BuffRx[BuffRx[IDX_MSG_LEN_BYTE]+1] = *((volatile UINT8*)Addr2);
    }

    // Wait for any EEPROM command in progress to complete.
    while (!(ESTAT & ESTAT_CCIF));

    // Program the data one word at a time. After writing, verify that the
    // word was programmed correctly.
    while (Addr1 < Addr2) {

        // Create the word to program from its component bytes.
        TempUINT16 = ((UINT16)BuffRx[TempUINT8] << 8) + BuffRx[TempUINT8+1];

        // Start the word programming sequence:
        // (1) Write the word to the desired address.
        // (2) Write the program word command to the command buffer.
        // (3) Launch the command by writing a '1' to the CBEIF flag.
        *((volatile UINT16*)Addr1) = TempUINT16;
        ECMD   = EE_PROGRAM_WORD;
        ESTAT |= ESTAT_CBEIF;

        // Delay a little bit.
        NOP();
        NOP();

        // Check for protection violation and access error indications.
        // If any error is indicated, clear the error flag.
        if (ESTAT & (ESTAT_PVIOL | ESTAT_ACCERR)) {
            if (ESTAT & ESTAT_PVIOL)  { ESTAT |= ESTAT_PVIOL;  }
            if (ESTAT & ESTAT_ACCERR) { ESTAT |= ESTAT_ACCERR; }
            return (ERASE_MEM_PVIOL_ACCERR_ERR);
        }

        // Wait for the word programming to complete.
        while (!(ESTAT & ESTAT_CCIF));

        // Verify that the word was correctly programmed.
        if (*((volatile UINT16*)Addr1) != TempUINT16) {
            return (WRITE_MEM_VERIFY_ERR);
        }

        // Increment data byte index and address to program for next time.
        TempUINT8 += BYTES_PER_WORD;
        Addr1     += BYTES_PER_WORD;
    }

    return (WRITE_MEM_NO_ERROR);
} 

//*********************************************************************
// processCommand
// This function processes a received bootloading command and puts a
// value in ErrorNum indicating whether an error occurred. A non-zero
// value indicates an error.
//*********************************************************************
_NEAR static void processCommand(void)
{
    switch (BuffRx[IDX_CMD_BYTE]) {
        case BT_CMD_FLASH_ERASE:
             ErrorNum = eraseFlash();
             break;

        case BT_CMD_EEPROM_ERASE:
             ErrorNum = eraseEEPROM();
             break;

        case BT_CMD_FLASH_PGM_VER:
             ErrorNum = programThenVerifyFlash();
             break;

        case BT_CMD_EEPROM_PGM_VER:
             ErrorNum = programThenVerifyEEPROM();
             break;

        default: // wrong command received
             ErrorNum = 1;
             break;
    }

    PPAGE = 0; // reset to page 0 (default)
    FCNFG = 0; // reset to block 0

    return;
}
